Revit 2024 API
ConceptualConstructionShadeType Enumeration
 ConceptualConstructionType values for Shades.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum ConceptualConstructionShadeType
Visual Basic
Public Enumeration ConceptualConstructionShadeType
Visual C++
public enum class ConceptualConstructionShadeType
Members
Member name | Description
InvalidShadeTypeConstruction |  Invalid value/not set Shade Type Construction
BasicShade |  Basic Shade
NumShadeTypeConstruction |  Total Number of Shade Type Constructions
See Also
Autodesk.Revit.DB.Analysis Namespace